/**
 * Created by Dell on 2017/2/21.
 */
var syscode = {
    0:"正确",

    //backend 赛事模块
    500:"赛事开始段",

    //backend 操盘模块
    1000:"操盘开始段",

    //backend 注单模块
    2000:"注单开始段",

    //backend 会员模块
    3000:"会员开始段",

    //backend 代理模块
    4000:"代理开始段",

    //backend 消息模块
    5000:"消息开始段",

    //backend 报表模块
    6000:"报表开始段",

    //系统服务模块:
    7000:"系统服务开始段",
    7001:"盘口不存在",
    7002:"盘口未在审核通过状态",
    7003:"盘口赛果为空",
    7004:"盘口赛果无效",
    7005:"盘口已结算过",
    7006:"盘口重复结算",
    7007:"盘口hash无效",
    7008:"回滚步骤错误",
    7009:"回滚资金流水错误数据",
    7010:"回滚资金流水无数据",
    7011:"回滚资金流水金额为零",
    7012:"回滚资金无相关流水",
    7013:"回滚资金无数据",
    7014:"算记录多于一条",
    7015:"结算记录不存在",
    7016:"算记录已存在",

    //frontend:
    8000:"用户端开始段"
}
